In [ ]:
# Importing Pandas to create DataFrame
import pandas as pd
 
# Creating Empty DataFrame and Storing it in variable df
df = pd.DataFrame()
 
# Printing Empty DataFrame
df

In [8]:
df = pd.DataFrame(columns=['Name', 'Age'])
df
# try add more columns

Empty DataFrame
Columns: [Name, Age]
Index: []

In [9]:
# initialize list of lists
data = [['tom', 10], ['nick', 15], ['juli', 14]]
data

[['tom', 10], ['nick', 15], ['juli', 14]]

In [10]:
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [11]:
data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]}
 
df = pd.DataFrame(data)
 
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [12]:
data = {'Name': ['Tom', 'Jack', 'nick', 'juli'],
        'marks': [99, 98, 95, 90]}
 
df = pd.DataFrame(data, index=['rank1',
                               'rank2',
                               'rank3',
                               'rank4'])
 
df

       Name  marks
rank1   Tom     99
rank2  Jack     98
rank3  nick     95
rank4  juli     90

In [13]:
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]
 
# Creates DataFrame.
df = pd.DataFrame(data)
 
# Print the data
df

    a   b   c
0   1   2   3
1  10  20  30

In [14]:
data = [{'b': 2, 'c': 3}, {'a': 10, 'b': 20, 'c': 30}]
 
df = pd.DataFrame(data, index=['first', 'second'])
 
df

         b   c     a
first    2   3   NaN
second  20  30  10.0

In [107]:
# Initialize data to Dicts of series.
d = {'one': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd'])}
 
df = pd.DataFrame(d)
 
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

# Basic Calculate Pandas

In [108]:
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [109]:
for index, row in df.iterrows():
    print(row['one'], row['two'])
    print(row['one'] + row['two'])

10 10
20
20 20
40
30 30
60
40 40
80

In [110]:
for index, row in df.iterrows():
    print(row)
    print('---')
    print(row['one'] + row['two'])
    print('---')
    
    sum_ = row['one'] + row['two']
    df.loc[index,'sum1'] = sum_

one    10
two    10
Name: a, dtype: int64
---
20
---
one    20
two    20
Name: b, dtype: int64
---
40
---
one    30
two    30
Name: c, dtype: int64
---
60
---
one    40
two    40
Name: d, dtype: int64
---
80
---

In [112]:
df

   one  two  sum1
a   10   10  20.0
b   20   20  40.0
c   30   30  60.0
d   40   40  80.0

In [113]:
df['sum2'] = df['one'] + df['two']
df
# try other syntax cal

   one  two  sum1  sum2
a   10   10  20.0    20
b   20   20  40.0    40
c   30   30  60.0    60
d   40   40  80.0    80

In [115]:
df['sum2'].mean()

50.0